Revit 2024 API
BuiltInFailures.GroupFailures.MoveElemFailed Property
 Unable to move element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MoveElemFailed { get; }
Visual Basic
Public Shared ReadOnly Property MoveElemFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MoveElemFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace